# NewXYZ Method (Double, Double, Double)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewXYZ Method (Double, Double, Double)
Application Class See Also
---
Creates a XYZ object representing coordinates in 3-space with supplied values.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ NewXYZ(
	double x,
	double y,
	double z
)
```

Visual Basic
---
```text
Public Function NewXYZ ( _
	x As Double, _
	y As Double, _
	z As Double _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ NewXYZ(
	double x,
	double y,
	double z
)
```

# ### Parameters
x
    Type: System..::..DoubleThe first coordinate.
y
    Type: System..::..DoubleThe second coordinate.
z
    Type: System..::..DoubleThe third coordinate.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when setting an infinite number to the X, Y or Z property. |

# See Also
Application Class
NewXYZ Overload
Autodesk.Revit.Creation Namespace